hotRoom6J_allABL/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.53e-3;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.53e-3;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            atmNutWallFunction;
              #include        "ABLConditions"
        value           uniform 1.53e-3;
    }
    bottom
    {
        type            atmNutWallFunction;
              #include        "ABLConditions"
        value           uniform 1.53e-3;
    }
    side01
    {
        type            symmetry;
    }

    side02
    {
        type            symmetry;
    }
}


// ************************************************************************* //
